import pandas as pd

In [1]:
import numpy as np

In [2]:
import pandas as pd

# Series

In [3]:
#labels array
labels = ['a','b','c']

#list array
my_list = [10, 20, 30]

arr = np.array([10, 20, 30])

#dictionary
d = {'a': 10, 'b' : 20, 'c':30} #in dictionary keys will be indices and the corresponding values will be the data
a= pd.Series(d)
a['a']
a['c']

30

`**Using list**

pd.Series (data = my_list)

In [4]:
pd.Series (index = labels , data =  my_list)

#keyword arguments

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series (  my_list , labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series (labels, my_list )

10    a
20    b
30    c
dtype: object

**Using Numpy Arrays**

In [7]:
pd.Series (arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series (arr , labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series ( labels, arr)

10    a
20    b
30    c
dtype: object

**Dictionaries**

In [10]:
pd.Series (d)

a    10
b    20
c    30
dtype: int64

**Data in series**

A pandas Series can hold a variety of object types

In [11]:
pd.Series (data = labels)

0    a
1    b
2    c
dtype: object

In [12]:
#Even funcyion (although unlikely that you will use this)
#in python everything is an object  so does not depend on what data you store so series can store any type of data
pd.Series ([sum , print , len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

# Using an index

In [13]:
ser1 = pd.Series([1,2,3,4], index = ['USA','Germany', 'USSA', 'Japan'])

In [14]:
ser1

USA        1
Germany    2
USSA       3
Japan      4
dtype: int64

In [15]:
 ser2 =  pd.Series([1,2,3,4], index = ['USA','Germany', 'Italy', 'Japan'])

In [16]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [17]:
ser1 ['Germany']

2

**Operations are then  also done based off of index**

In [18]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSA       NaN
dtype: float64

# Dataframes
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. we can think of a Dataframe as a bunch of series objects put together to share the sam index .

In [19]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import randn
np.random.seed(101)

In [21]:
pd.DataFrame?

In [22]:
df = pd.DataFrame (randn(5,4), index= 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
print(type (df))
print (type (df['W']))
print (df['W']['A'])

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
2.706849839399938

# Selection and Indexing

In [25]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
#pass a list of column names
df[['W' , 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [27]:
#sql Syntax (NOT RECOMMENDED)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
type (df['W'])

pandas.core.series.Series

**CREATING A NEW COLUMN**

In [29]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**REMOVING COLUMN**

In [31]:
df.drop('new' , axis = 1)
#axis 1 means to drop one column axis = 1
#axis 0 means to drop one row axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [33]:
df.drop('new' , axis = 1 , inplace =True)

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.drop('E', axis = 0 , inplace = True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Selecting rows

In [39]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

**Or select based off of position instead of label**

In [40]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

**Selecting sumset of rows and columns**

In [41]:
df.loc['B', 'Y']

-0.8480769834036315

In [42]:
df.loc[['A' ,'B'] , ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Conditional Selection 
*An important feature of pandas is conditional selection using bracket notations ,very similar to numpy.

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [45]:
df[df > 0] #very important

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [46]:
df [df['X'] < 0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [47]:
df[df['W'] > 0] ['Y']

A    0.907969
B   -0.848077
D   -0.933237
Name: Y, dtype: float64

In [48]:
df[df['W'] > 0] [['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

**For two conditions you can use | and & with parenthesis

In [49]:
df[(df['W'] > 0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

# More index Details

Features of indexing , including resetting the index or setting it something else , index hierarchy

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
#Reset to default  0 , 1 ,... n index

In [52]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057